{
    "cells": [
        {
            "title": "React",
            "description": "I used React in combination with Gatsby for developing this simple mini-site and Netlify for a faster but efficient tool to manage it from concept to production. I had so much fun building the project, that I didn't even notice how much fast I learnt the basics. I find it super-useful when you have to build something fairly static and in a very small amount of time.",
            "image": "https://cdn.jsdelivr.net/gh/devicons/devicon/icons/react/react-original-wordmark.svg"
        },
        {
            "title": "Typescript",
            "description": "Used in combination with React and Material UI, I thought to have found the stack that fits me most.",
            "image": "https://cdn.jsdelivr.net/gh/devicons/devicon/icons/typescript/typescript-original.svg"
        },
        {
            "title": "Headed CMS",
            "description": "Mostly used and abused in its plain form, I started developing in PHP and SASS using a particular internal tool which give the possibility to use the WP backend GUI - and its simplifications - connected to some powerful plugins like ACF Pro together for build a custom styled front-end, and so, substancially starting right from a blank template to work on.",
            "image": "https://cdn.jsdelivr.net/gh/devicons/devicon/icons/wordpress/wordpress-plain.svg"
        },
        {
            "title": "SCSS/SASS",
            "description": "With SCSS/SASS has been love at first sight; After studying basic CSS3 without ever achieving the desired structure and logic I had in mind for my project, I had the chance to experiment, test, and build a consistent code in my stylesheets thanks to SASS. I also started studiyng and applying some conventions while coding; the two I'm more comfortable with are BEM and ITCSS.",
            "image": "https://cdn.jsdelivr.net/gh/devicons/devicon/icons/sass/sass-original.svg"
        },
        {
            "title": "Styled Components",
            "description": "I like to experiment always different methods, development tools and approaches, especially in terms of font-end style suites. I choose to use this one in combination with React+Gatsby.",
            "image": "https://styled-components.com/logo.png"
        },
        {
            "title": "Tailwind",
            "description": "Tailwind is a very powerful library, the more ITCSS oriented I've tested. My intent for my next project is in fact to combine it with React, Gatsby and Next.js for a music related app.",
            "image": "https://cdn.jsdelivr.net/gh/devicons/devicon/icons/tailwindcss/tailwindcss-plain.svg"
        },
        {
            "title": "Git",
            "description": "Git, GitHub or GitLab isn't a matter of concern; Once I started to write code in a collaborative manner, it was crucial to being able to use a clear and simple versioning control system. 'add - commit - pull & push' is what one of colleagues always reminded me to do in the early days and also my personal mantra since I begin developing.",
            "image": "https://cdn.jsdelivr.net/gh/devicons/devicon/icons/git/git-original.svg"
        },
        {
            "title": "Node",
            "description": "I've tested myself with Node and a couple of its micro-services and the primordial version of Ishtar; Due to the complexity of the project, I based the data storage client-side instead of server side. But for the future version of the project I will be prepared to face it once again! ",
            "image": "https://cdn.jsdelivr.net/gh/devicons/devicon/icons/nodejs/nodejs-plain-wordmark.svg"
        },
        {
            "title": "TensorFlow",
            "description": "I learnt to use a little part of this library for retrieving eye-gaze data of the user on a specific portion of the screen for developing my first structured code project named 'Ishtar'.",
            "image": "https://cdn.jsdelivr.net/gh/devicons/devicon/icons/tensorflow/tensorflow-original.svg"
        },
        {
            "title": "PHP",
            "description": "PHP is the main back-end language I adopted in most corporate projects. For server related dta communications I prefer using Node and its micro-services, but in many cases for my level of knowledge and projects, PHP works just fine.",
            "image": "https://cdn.jsdelivr.net/gh/devicons/devicon/icons/php/php-plain.svg"
        },
        {
            "title": "MySQL",
            "description": "MySQL's the main DB I experimented with.",
            "image": "https://cdn.jsdelivr.net/gh/devicons/devicon/icons/mysql/mysql-plain.svg"
        },
        {
            "title": "Sketch",
            "description": "Sketch is the main tool I choose in building custom UI for different projects. I composed a custom set up for automating repetitive actions ( using plugins like Automate, Runner, Fontily and Symbol Organizer) and Craft for publishing directly in Invision. Beyond prototyping tools, I also have a consistent knowledge of the Adobe suite, especially with Adobe Photoshop, Adobe Illustrator and After Effects. ",
            "image": "https://cdn.jsdelivr.net/gh/devicons/devicon/icons/sketch/sketch-original.svg"
        },
        {
            "title": "Figma",
            "description": "Figma is the first prototyping tool I've approached in UI designs. I prefer to use it for animated prototypes and Mobile interfaces.",
            "image": "https://cdn.jsdelivr.net/gh/devicons/devicon/icons/figma/figma-original.svg"
        },
        {
            "title": "Docker",
            "description": "'Docker Engine starting...'",
            "image": "https://cdn.jsdelivr.net/gh/devicons/devicon/icons/docker/docker-plain-wordmark.svg"
        }
    ]
}